<template>
    <div>
      （如果有了ssh密匙 就不需要每次都打账号密码了）
      **下午开始学习git版本控制概念
      1.Git是什么：目前世界上最先进的分布式版本控制系统（没有之一）。
      2.版本控制系统是什么：不但能自动帮我记录每次文件的改动，还可以让同事协作编辑
      这样，你就结束了手动管理多个“版本”的史前时代，进入到版本控制的20世纪。
      3.（SVN）中式版本控制系统：中央服务器就好比是一个图书馆，你要改一本书，必须先从图书馆借出来，
      然后回到家自己改，改完了，再放回图书馆。（局域网限制||不能建本地仓库）
      4.（Git）分布式版本控制系统：没有“中央服务器”==没有图书馆。每个人的电脑都是图书馆。
      我修改了A。同事修改了A。只需各自推送就可以互相看到对方的修改了。

      **Git分支的作用

      例子：假设你准备开发一个新功能，但是需要两周才能完成，第一周你写了50%的代码
      如果立刻提交，由于代码还没写完，不完整的代码库会导致别人不能干活了。
      如果等代码全部写完再一次提交，又存在丢失每天进度的巨大风险。

      效果：你创建了一个属于你自己的分支，别人看不到，还继续在原来的分支上正常工作，
      而你在自己的分支上干活，想提交就提交，直到开发完毕后，再一次性合并到原来的分支上，
      这样，既安全，又不影响别人工作。

      优势：但Git的分支是与众不同的，无论创建、切换和删除分支，Git在1秒钟之内就能完成！
      无论你的版本库是1个文件还是1万个文件。

      **Git鼓励大量使用分支：
      查看分支：git branch
      创建+切换分支：git checkout -b <name>
      合并某分支到当前分支：git merge <name>
      删除分支：git branch -d <name>

      *练习使用技巧*
      pwd 显示当前目录
      创建仓库git init
      查看状态 git status
      添加到暂存区git add xiyouji.tex
      提交git commit -m“描述”
      查看记录 git log
      通过记录id 变回原来id的内容 git checkout （第几次的id）
      附注标签 git tag -a 标签名 -m“备注” 加id瞄点
      快速查找标签信息 git show 标签名
      创建分支 git branch <name>
      切换分支：git checkout <name> 后继续生产
      图示全部历史记录 git log --all --graph
      创建完发生bug的分支后，测试没问题就合并 git merge <分支名>

        **添加远程仓局地址（直接在config修改）
        克隆回来的地址==它会默认为你以后上传的地址
        方法：git remote add porject https://github.com/601460003/porject.git
        列出所有远程仓库git remote详细信息：git remote -v 仓库的网址fetch（下载地址）push（上传地址）
        上传代码：git push -u porject master（上传的分支）
    </div>
</template>
